renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_dns_client_rx/src/r_dns_client.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2011 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_dns_client.c
* Version      : --.--
* Device(s)    : any
* Tool-Chain   : any
* OS     : any
* H/W Platform : any
* Description  : This is the dns client code.
* Operation    :
* Limitations  :
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version  Description
*         : 04.04.2011 1.00    First Release
*         : 09.05.2014 1.01    Corresponded to FIT Modules
*         : 01.07.2014 1.02    Clean up source code
*         : 01.04.2016 1.03    XML file update
*         : 01.03.2017 1.04    Change API function name
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include <string.h>
#include <stdint.h>
#include "r_t4_itcpip.h"
#include "r_t4_dns_client_rx_config.h"
#include "r_t4_dns_client_rx_if.h"
#include "r_dns_client.h"
#include "r_sys_time_rx_if.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/


/***********************************************************************************************************************
Exported global variables (to be accessed by other files)
***********************************************************************************************************************/
#ifdef _UNIT_TEST_DNS
extern uint8_t flag_sntp_process;
extern uint32_t dns_test_timeout_set;
extern uint8_t flag_proc_C3;
extern uint8_t flag_proc_D4;
extern uint8_t flag_proc_I3;
#endif

/***********************************************************************************************************************
Exported global functions (to be accessed by other files)
***********************************************************************************************************************/
extern void timer_interrupt(void* pdata);

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
DNS_CLIENT_STATIC uint8_t dns_buffer[512];
DNS_CLIENT_STATIC dns_packet_t dns_packet;
DNS_CLIENT_STATIC uint16_t TRANSACTION_ID = 0;
DNS_CLIENT_STATIC name_table_t name_table;
DNS_CLIENT_STATIC dns_mng_t  dns_mng;
DNS_CLIENT_STATIC dns_address_t dns_ipaddr;
DNS_CLIENT_STATIC dns_address_t dns_ipaddr_sub;


DNS_CLIENT_STATIC dns_err_t dns_dummy_proc(void);
DNS_CLIENT_STATIC dns_err_t dns_error_proc(void);
DNS_CLIENT_STATIC dns_err_t dns_already_proc(void);
DNS_CLIENT_STATIC dns_err_t dns_close_proc(void);
DNS_CLIENT_STATIC dns_err_t dns_no_proc(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_A1(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_B2(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_C3(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_D3(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_D4(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_D7(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_E3(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_E5(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_F3(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_G3(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_H3(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_H6(void);
DNS_CLIENT_STATIC dns_err_t dns_proc_I3(void);

static const DNS_PROC_FUNC dns_proc_table[DNS_PROC_NUM][DNS_EVENT_NUM] =
{
    /* A.resting DNS client */
    {
        dns_proc_A1,       /* 1.called open function         */
        dns_error_proc,    /* 2.received request             */
        dns_error_proc,    /* 3.periodic                     */
        dns_error_proc,    /* 4.complete sending callback    */
        dns_error_proc,    /* 5.complete receiving callback  */
        dns_error_proc,    /* 6.complete canceling callback  */
        dns_error_proc,    /* 7.send ARP timeout callback    */
        dns_error_proc     /* 8.called close function        */
    },

    /* B.unreceived request    */
    {
        dns_already_proc,  /* 1.called open function         */
        dns_proc_B2,       /* 2.received request             */
        dns_no_proc,       /* 3.periodic                     */
        dns_dummy_proc,    /* 4.complete sending callback    */
        dns_no_proc,       /* 5.complete receiving callback  */
        dns_dummy_proc,    /* 6.complete canceling callback  */
        dns_dummy_proc,    /* 7.send ARP timeout callback    */
        dns_close_proc     /* 8.called close function        */
    },

    /* C.start sending    */
    {
        dns_already_proc,  /* 1.called open function         */
        dns_dummy_proc,    /* 2.received request             */
        dns_proc_C3,       /* 3.periodic                     */
        dns_dummy_proc,    /* 4.complete sending callback    */
        dns_no_proc,       /* 5.complete receiving callback  */
        dns_dummy_proc,    /* 6.complete canceling callback  */
        dns_dummy_proc,    /* 7.send ARP timeout callback    */
        dns_close_proc     /* 8.called close function        */
    },
    /* D.wait to complete sending request */
    {
        dns_already_proc,  /* 1.called open function         */
        dns_dummy_proc,    /* 2.received request             */
        dns_proc_D3,       /* 3.periodic                     */
        dns_proc_D4,       /* 4.complete sending callback    */
        dns_no_proc,       /* 5.complete receiving callback  */
        dns_dummy_proc,    /* 6.complete canceling callback  */
        dns_proc_D7,       /* 7.send ARP timeout callback    */
        dns_close_proc     /* 8.called close function        */
    },
    /* E.wait to complete receiveing request*/
    {
        dns_already_proc,  /* 1.called open function         */
        dns_dummy_proc,    /* 2.received request             */
        dns_proc_E3,       /* 3.periodic                     */
        dns_dummy_proc,    /* 4.complete sending callback    */
        dns_proc_E5,       /* 5.complete receiving callback  */
        dns_dummy_proc,    /* 6.complete canceling callback  */
        dns_dummy_proc,    /* 7.send ARP timeout callback    */
        dns_close_proc     /* 8.called close function        */
    },
    /* F.finish       */
    {
        dns_already_proc,  /* 1.called open function         */
        dns_dummy_proc,    /* 2.received request             */
        dns_proc_F3,       /* 3.periodic                     */
        dns_dummy_proc,    /* 4.complete sending callback    */
        dns_no_proc,       /* 5.complete receiving callback  */
        dns_dummy_proc,    /* 6.complete canceling callback  */
        dns_dummy_proc,    /* 7.send ARP timeout callback    */
        dns_close_proc     /* 8.called close function        */
    },
    /* G.cancelling      */
    {
        dns_already_proc,  /* 1.called open function         */
        dns_dummy_proc,    /* 2.received request             */
        dns_proc_G3,       /* 3.periodic                     */
        dns_dummy_proc,    /* 4.complete sending callback    */
        dns_no_proc,       /* 5.complete receiving callback  */
        dns_dummy_proc,    /* 6.complete canceling callback  */
        dns_dummy_proc,    /* 7.send ARP timeout callback    */
        dns_close_proc     /* 8.called close function        */
    },
    /* H.wait to complete cancelling */
    {
        dns_already_proc,  /* 1.called open function         */
        dns_dummy_proc,    /* 2.received request             */
        dns_proc_H3,       /* 3.periodic                     */
        dns_dummy_proc,    /* 4.complete sending callback    */
        dns_no_proc,       /* 5.complete receiving callback  */
        dns_proc_H6,       /* 6.complete canceling callback  */
        dns_dummy_proc,    /* 7.send ARP timeout callback    */
        dns_close_proc     /* 8.called close function        */
    },
    /* I.cancelled      */
    {
        dns_already_proc,  /* 1.called open function         */
        dns_dummy_proc,    /* 2.received request             */
        dns_proc_I3,       /* 3.periodic                     */
        dns_dummy_proc,    /* 4.complete sending callback    */
        dns_no_proc,       /* 5.complete receiving callback  */
        dns_dummy_proc,    /* 6.complete canceling callback  */
        dns_dummy_proc,    /* 7.send ARP timeout callback    */
        dns_close_proc     /* 8.called close function        */
    }
};

DNS_CLIENT_STATIC dns_err_t dns_dummy_proc(void)
{
    /* None */

