renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_dns_client_rx/src/r_dns_client.c
    return DNS_SUCCESS;
}

DNS_CLIENT_STATIC dns_err_t dns_no_proc(void)
{
    /* None */

    return DNS_SUCCESS;
}

DNS_CLIENT_STATIC dns_err_t dns_error_proc(void)
{
    /* None */
    return DNS_ERR_NOT_OPENED;
}

DNS_CLIENT_STATIC dns_err_t dns_already_proc(void)
{
    /*None*/
    return DNS_ERR_ALREADY_OPENED;
}

DNS_CLIENT_STATIC dns_err_t dns_close_proc(void)
{

    dns_mng.proc = DNS_PROC_REST;   /* proc <- A.rested */

    if (R_SYS_TIME_UnregisterPeriodicCallback((callback_from_sys_time_t)&dns_client_process) == SYS_TIME_BAD_FUNCTION_POINTER)
    {
        return DNS_ERR_NOT_OPENED;
    }

    memset(&dns_mng.name[0], 0, sizeof(dns_mng.name)); /* domain name <- all '\0'        */
    clear_table(&name_table);

    return DNS_SUCCESS;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_A1(void)
{
    dns_mng.proc = DNS_PROC_UNRECEIVED_REQUEST;

    return DNS_SUCCESS;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_B2(void)
{
    dns_mng.proc = DNS_PROC_START_SENDING; /* proc <- C.start sending */

    return DNS_SUCCESS;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_C3(void)
{
    dns_err_t  ercd;
    uint32_t dstaddr;

    ercd = DNS_SUCCESS;

    if (DNS_SELECT_PRIMARY == dns_mng.dns_select)
    {
        dstaddr = dns_ipaddr.dnsaddr1;
    }
    else if (DNS_SELECT_SECONDARY == dns_mng.dns_select)
    {
        dstaddr = dns_ipaddr.dnsaddr2;
    }
    else
    {
        /* None */
    }

    if (E_WBLK == send_dns_request(dns_mng.name, dstaddr))
    {
        dns_reset_timer();
        dns_mng.proc = DNS_PROC_SENDING_REQUEST_WAIT; /* proc <- D.wait to complete sending request */
#ifdef _UNIT_TEST_DNS
        flag_proc_C3 = 1;
#endif
    }
    else
    {
        ercd = DNS_ERR_BAD_UDP_SETTINGS;
        dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */
        dns_mng.retry_cnt = 0;     /* no retry */
#ifdef _UNIT_TEST_DNS
        flag_proc_C3 = 1;
#endif
    }

    return ercd;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_D3(void)
{
    dns_err_t  ercd;

    ercd = DNS_SUCCESS;

    dns_timeout_timer();

    if (0 == dns_mng.dns_timer)
    {
        dns_mng.proc = DNS_PROC_CANCELLING;  /* proc <- G.cancelling */
        ercd = DNS_ERR_TIMEOUT;
    }
    return ercd;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_D4(void)
{
    dns_reset_timer();
    dns_mng.proc = DNS_PROC_RECEIVING_REQUEST_WAIT; /* proc <- E.wait to complete receiveing request */
#ifdef _UNIT_TEST_DNS
    flag_proc_D4 = 1;
#endif

    return DNS_SUCCESS;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_D7(void)
{
    dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */
    dns_mng.retry_cnt = 0;     /* no retry */

    return DNS_ERR_TIMEOUT;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_E3(void)
{
    dns_err_t  ercd;

    ercd = DNS_SUCCESS;
    dns_timeout_timer();

    if (0 == dns_mng.dns_timer)
    {
        dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */
        ercd = DNS_ERR_TIMEOUT;
    }
    return ercd;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_E5(void)
{
    dns_err_t ercd;

    clear_table(&name_table);

    if (0 <= receive_dns_response(&name_table))
    {
        dns_mng.proc = DNS_PROC_FINISH;   /* proc <- F.finish */
        ercd = DNS_SUCCESS;
    }
    else
    {
        dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */
        dns_mng.retry_cnt = 0;     /* no retry */
        dns_mng.dns_error_type = DNS_ERR_INVALID_PACKET_RECEIVED;
        ercd = DNS_ERR_INVALID_PACKET_RECEIVED;
    }

    return ercd;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_F3(void)
{
    dns_err_t ercd;

    ercd = DNS_SUCCESS;

    if (NULL != dns_mng.cb_func)
    {
        dns_mng.cb_func(ercd, &name_table);
    }

    dns_mng.proc = DNS_PROC_UNRECEIVED_REQUEST;  /* proc <- A.unreceived request */

    return ercd;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_G3(void)
{
    dns_err_t ercd;

    ercd = DNS_SUCCESS;

    if (E_OK == udp_can_cep(dns_mng.cepid, TFN_UDP_ALL))
    {
        dns_mng.dns_timer = DNS_CANCEL_TIMEOUT_MS;
        dns_mng.proc = DNS_PROC_CANCELLING_WAIT; /* proc <- H.wait to complete cancelling */
    }
    else
    {
        dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- A.unreceived request */
        ercd = DNS_ERR_BAD_UDP_SETTINGS;
    }
    return ercd;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_H3(void)
{

    dns_timeout_timer();

    if (0 == dns_mng.dns_timer)
    {
        dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */
        dns_mng.retry_cnt = 0;     /* no retry */
    }

    return DNS_ERR_TIMEOUT;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_H6(void)
{
    dns_mng.proc = DNS_PROC_CANCELLED;  /* proc <- I.cancelled */

    return DNS_ERR_TIMEOUT;
}

DNS_CLIENT_STATIC dns_err_t dns_proc_I3(void)
{
    dns_err_t ercd;

    ercd = DNS_SUCCESS;
#ifdef _UNIT_TEST_DNS
    flag_proc_I3 = 1;
#endif

    if (dns_mng.retry_cnt > 0)
    {
        dns_mng.retry_cnt--;
        dns_mng.proc = DNS_PROC_START_SENDING; /* proc <- C.start sending */
    }
    else
    {
        if(DNS_ERR_BAD_UDP_SETTINGS == dns_mng.dns_error_type)
        {
            if (NULL != dns_mng.cb_func)
            {
                dns_mng.cb_func(dns_mng.dns_error_type, NULL);
                dns_mng.proc = DNS_PROC_UNRECEIVED_REQUEST;
            }
        }
        else if(DNS_ERR_TIMEOUT == dns_mng.dns_error_type)  /*if(dns_mng.dns_error_type == DNS_ERR_BAD_UDP_SETTINGS)*/
        {
            if (DNS_SELECT_PRIMARY == dns_mng.dns_select)
            {
                dns_mng.dns_select = DNS_SELECT_SECONDARY;
                dns_mng.retry_cnt = DNS_ERROR_COUNT;
                dns_mng.proc = DNS_PROC_START_SENDING; /* proc <- C.start sending */
            }
            else
            {
                dns_mng.proc = DNS_PROC_UNRECEIVED_REQUEST;  /* proc <- A.unreceived request */

