renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_dns_client_rx/src/r_dns_client.c
                if (NULL != dns_mng.cb_func)
                {
                    dns_mng.cb_func(dns_mng.dns_error_type, NULL);
                }
            }
        }
        else if(DNS_ERR_INVALID_PACKET_RECEIVED == dns_mng.dns_error_type)    /*if(dns_mng.dns_error_type == DNS_ERR_BAD_UDP_SETTINGS)*/
        {
            if (DNS_SELECT_PRIMARY == dns_mng.dns_select)
            {
                dns_mng.dns_select = DNS_SELECT_SECONDARY;
                dns_mng.retry_cnt = DNS_ERROR_COUNT;
                dns_mng.proc = DNS_PROC_START_SENDING; /* proc <- C.start sending */
            }
            else
            {
                dns_mng.proc = DNS_PROC_UNRECEIVED_REQUEST;  /* proc <- A.unreceived request */

                if (NULL != dns_mng.cb_func)
                {
                    dns_mng.cb_func(dns_mng.dns_error_type, NULL);
                }
            }
        }
        else
        {
          /* None */
        }
    }
    return ercd;
}

/***********************************************************************************************************************
* Function Name: send_dns_request
* Description  : sending DNS packet
* Arguments    : *name -
*                    pointer to name table
*                *dstaddr -
*                    pointer to address of destination
* Return Value : count
***********************************************************************************************************************/
DNS_CLIENT_STATIC int32_t send_dns_request(char *name, uint32_t dstaddr)
{
    static T_IPV4EP dns;
    int32_t ercd;

    dns.ipaddr = dstaddr;
    dns.portno = 53;

    dns_packet.header.ID       = htons(TRANSACTION_ID);
    dns_packet.header.Flag     = htons(0x0100);
    dns_packet.header.QDCOUNT  = htons(1);
    dns_packet.header.ANCOUNT  = htons(0);
    dns_packet.header.NSCOUNT  = htons(0);
    dns_packet.header.ARCOUNT  = htons(0);

    memcpy(dns_buffer, &dns_packet.header, sizeof(dns_packet.header));

    dns_packet.question.QNAME   = name;
    dns_packet.question.QTYPE   = htons(0x0001);
    dns_packet.question.QCLASS  = htons(0x0001);

    convert_name_to_dns_query((char*)&dns_buffer[sizeof(dns_packet.header)], name);

    dns_buffer[((sizeof(dns_packet.header))+strlen((char*)name))+1]  = 0;

#if defined(__BIG)
    dns_buffer[((sizeof(dns_packet.header))+strlen((char*)name))+2]  = ((dns_packet.question.QTYPE & 0xff00) >> 8);
    dns_buffer[((sizeof(dns_packet.header))+strlen((char*)name))+3]  = (dns_packet.question.QTYPE & 0x00ff);
    dns_buffer[((sizeof(dns_packet.header))+strlen((char*)name))+4]  = ((dns_packet.question.QCLASS & 0xff00) >> 8);
    dns_buffer[((sizeof(dns_packet.header))+strlen((char*)name))+5]  = (dns_packet.question.QCLASS & 0x00ff);
#else
    dns_buffer[((sizeof(dns_packet.header))+strlen((char*)name))+3]  = ((dns_packet.question.QTYPE & 0xff00) >> 8);
    dns_buffer[((sizeof(dns_packet.header))+strlen((char*)name))+2]  = (dns_packet.question.QTYPE & 0x00ff);
    dns_buffer[((sizeof(dns_packet.header))+strlen((char*)name))+5]  = ((dns_packet.question.QCLASS & 0xff00) >> 8);
    dns_buffer[((sizeof(dns_packet.header))+strlen((char*)name))+4]  = (dns_packet.question.QCLASS & 0x00ff);
#endif

    ercd = udp_snd_dat(dns_mng.cepid, &dns, dns_buffer, ((sizeof(dns_packet.header)) + strlen((char*)name)) + 6, TMO_NBLK);

    return ercd;

}

/***********************************************************************************************************************
* Function Name: receive_dns_response
* Description  : receiving DNS response
* Arguments    : *table -
*                    pointer to name table
* Return Value : count
***********************************************************************************************************************/
DNS_CLIENT_STATIC int32_t receive_dns_response(name_table_t *table)
{

    T_IPV4EP dstaddr;
    int32_t receive_data_len = 0;
    uint16_t answer_offset = 0;
    int32_t query_size = 0;
    uint8_t answer_count = 0;
    uint8_t answer_check_count = 0;
    uint16_t answer_size = 0;
    uint8_t query_type = 0;

    receive_data_len = udp_rcv_dat(1, &dstaddr, dns_buffer, 512 , TMO_POL);

    if (receive_data_len < 0)
    {
        return -1;
    }

    memcpy(&dns_packet.header, dns_buffer, sizeof(dns_packet.header));

    answer_count = answer_check_count = htons(dns_packet.header.ANCOUNT);
    if (answer_count > DNS_BUFFER_COUNT)
    {
        answer_count = answer_check_count = DNS_BUFFER_COUNT;
    }
    else if (0 == answer_count)
    {
        return -1;
    }
    else
    {

    }

    if (htons(TRANSACTION_ID++) != dns_packet.header.ID )
    {
        return -1;
    }

    if (!(dns_packet.header.Flag & htons(0x8000)))  // Response Bit(1) : Message is a response
    {
        return -1;
    }

    if (dns_packet.header.Flag & htons(0x7800))   // Op Code(0000) : Standard query
    {
        return -1;
    }

    if (dns_packet.header.Flag & htons(0x000f))   // Reply Code(0000) : No error
    {
        return -1;
    }

    query_size = check_query((char*) & dns_buffer[sizeof(dns_packet.header)]);
    if (query_size < 0)
    {
        return -1;
    }
    answer_offset = query_size + (sizeof(dns_packet.header));

    while (answer_check_count)
    {
        answer_size = check_answer((char*) & dns_buffer[answer_offset], (char*)dns_buffer, table, &query_type);
        answer_offset += answer_size;
        if (DNS_QUERY_TYPE_A == query_type)
        {
            answer_check_count--;
        }
    }

    return 0;
}

/***********************************************************************************************************************
* Function Name: convert_name_to_dns_query
* Description  : converting domain name to DNS query
* Arguments    : *query -
*                    pointer to the query
*                 *name -
*                    pointer to name table
* Return Value : count
***********************************************************************************************************************/
DNS_CLIENT_STATIC int32_t convert_name_to_dns_query(char *query, char *name)
{
    uint8_t count = 0;
    uint8_t loop_counter = 0;
    uint8_t label_cnt = 0;
    uint8_t name_len = strlen((char*)name);
    uint8_t charactor;

    memcpy(query + 1, name, strlen((char*)name));

    while (loop_counter < name_len)
    {
        charactor = *name;
        name++;
        if (charactor == '.')
        {
            *query = label_cnt;
            query += (label_cnt + 1);
            label_cnt = 0;
        }
        else
        {
            label_cnt++;
        }
        loop_counter++;
    }

    *query = label_cnt;

