renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_dns_client_rx/src/r_dns_client.c
    return count;
}

/***********************************************************************************************************************
* Function Name: check_query
* Description  : Checking the query
* Arguments    : *query -
*                    pointer to the query
* Return Value : ((query + 5) - check)
***********************************************************************************************************************/
DNS_CLIENT_STATIC int32_t check_query(char *query)
{
    char (*check) = query;

    while (0x00 != (*query))
    {
        query += ((*query) + 1);
        if ((query - check) > 0xff)
        {
            return -1;
        }
    }
    return ((query + 5) - check);

}

/***********************************************************************************************************************
* Function Name: check_answer
* Description  : Checking the received answer from DNS server
* Arguments    : *answer -
*                    pointer to the received answer from DNS server
*                *dns_response -
*                    pointer to the received response from DNS server
*                *table -
*                    Name table
*                *query_type -
*                    type of query
* Return Value : answer_length
***********************************************************************************************************************/
DNS_CLIENT_STATIC int32_t check_answer(char *answer, char *dns_response, name_table_t *table, uint8_t *query_type)
{

    uint16_t src_offset = 0;
    uint16_t answer_length = 0;
    uint16_t query_length = 0;

    if (((*answer) & 0xc0) == 0xc0)
    {
        switch (answer[3])
        {

            case DNS_QUERY_TYPE_A:
                src_offset = ((*answer) & (~0xc0)) << 8;
                src_offset |= (*(answer + 1));

                query_length = get_name_till_stringend(&dns_response[src_offset], dns_response, table);

                memcpy(table->ipaddr, &answer[12], 4);
                answer_length = 16;
                *query_type = DNS_QUERY_TYPE_A;
                break;

            case DNS_QUERY_TYPE_CNAME:
                table->name[0] = 0;
                answer_length = answer[11] + 12;
                *query_type = DNS_QUERY_TYPE_CNAME;
                break;

            default:
                *query_type = DNS_QUERY_TYPE_UNKNOWN;
                break;
        }
    }
    else
    {
        query_length = get_name_till_stringend(answer, dns_response, table);

        switch (answer[query_length + 2])
        {
            case DNS_QUERY_TYPE_A:
                memcpy(table->ipaddr, &answer[query_length + 11], 4);
                answer_length = 15 + query_length;
                *query_type = DNS_QUERY_TYPE_A;
                break;

            case DNS_QUERY_TYPE_CNAME:
                table->name[0] = 0;
                answer_length = (answer[query_length + 10] + query_length) + 11;
                *query_type = DNS_QUERY_TYPE_CNAME;
                break;

            default:
                *query_type = DNS_QUERY_TYPE_UNKNOWN;
                break;
        }
    }
    return answer_length;
}

/***********************************************************************************************************************
* Function Name: get_name_till_stringend
* Description  :
* Arguments    :
* Return Value : src_offset
***********************************************************************************************************************/
DNS_CLIENT_STATIC int32_t get_name_till_stringend(const char *string, const char *dns_response, name_table_t *table)
{
    uint16_t dst_offset = 0;
    uint16_t src_offset = 0;
    uint16_t next_offset = 0;

    while (0x00 != string[src_offset])
    {
        if (strlen(table->name) > DNS_CFG_NAME_SIZE)
        {
            return -1;
        }
        if ((string[src_offset] & 0xc0) == 0xc0)
        {
            next_offset = (string[src_offset] & (~0xc0)) << 8;
            next_offset |= (string[src_offset + 1]);
            dst_offset += get_name_till_stringend(&dns_response[next_offset], dns_response, table);

            while ((string[src_offset] & 0xc0) == 0xc0)
            {
                src_offset += 2;
                if (src_offset > DNS_CFG_NAME_SIZE)
                {
                    return -1;
                }
            }
        }

        else
        {
            strncat((char*)table->name, (char*)&string[src_offset+1], string[src_offset]);
            dst_offset += (string[src_offset] + 1);
            src_offset += (string[src_offset] + 1);
            if (0x00 != string[src_offset])
            {
                strcat((char*)table->name, ".");
            }
        }
    }
    return src_offset;
}

/***********************************************************************************************************************
* Function Name: clear_table
* Description  : clear to 0 on name table
* Arguments    :
* Return Value : void
***********************************************************************************************************************/
DNS_CLIENT_STATIC void clear_table(name_table_t *table)
{
    memset(table, 0, sizeof(name_table_t));
}

/***********************************************************************************************************************
* Function Name: htons
* Description  : convert from little endian to big endian when host is little
* Arguments    :
* Return Value : data
***********************************************************************************************************************/
DNS_CLIENT_STATIC uint16_t htons(uint16_t data)
{

    uint16_t tmp = 0;
#ifndef __BIG
    tmp  = (data & 0x00ff) << 8;
    tmp  |= ((data & 0xff00) >> 8);
    data = tmp;
#endif
    return data;
}

/***********************************************************************************************************************
* Function Name: htonl
* Description  : convert from little endian to big endian when host is little
* Arguments    :
* Return Value : data
***********************************************************************************************************************/
DNS_CLIENT_STATIC uint32_t htonl(uint32_t data)
{

    uint32_t tmp = 0;
#ifndef __BIG
    tmp   =  (data & 0x000000ff) << 24;
    tmp  |= ((data & 0x0000ff00) <<  8);
    tmp  |= ((data & 0x00ff0000) >>  8);
    tmp  |= ((data & 0xff000000) >> 24);
    data = tmp;
#endif
    return data;
}
/***********************************************************************************************************************
* Function Name: dns_timeout_timer
* Description  : counting timeout
* Arguments    :
* Return Value : void
***********************************************************************************************************************/
DNS_CLIENT_STATIC void  dns_timeout_timer(void)
{
    if(dns_mng.dns_timer > 0)
    {
        dns_mng.dns_timer--;
    }
}

