renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_dns_client_rx/src/r_dns_client.c
/***********************************************************************************************************************
* Function Name: dns_reset_timer
* Description  : reset timeout timer
* Arguments    :
* Return Value : void
***********************************************************************************************************************/
DNS_CLIENT_STATIC void dns_reset_timer(void)
{
#ifndef _UNIT_TEST_DNS
    dns_mng.dns_timer = DNS_CFG_TIMEOUT * 100;
#else
    dns_mng.dns_timer = dns_test_timeout_set * 100;
#endif
}

/***********************************************************************************************************************
* Function Name: dns_client_process
* Description  : DNS client main process.
*                This function must be called periodic.
* Arguments    : none
* Return Value : error code
***********************************************************************************************************************/
dns_err_t dns_client_process(void)
{
    dns_err_t ercd;

    ercd = DNS_SUCCESS;
#ifdef _UNIT_TEST_DNS
    flag_sntp_process = 1;
#endif

    if (dns_mng.proc < DNS_PROC_NUM)
    {
        ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_PERIODIC]();
    }
    else
    {
        /* System Error */
    }

    if (DNS_ERR_TIMEOUT == ercd)
    {
        dns_mng.dns_error_type = DNS_ERR_TIMEOUT;
    }
    else if (DNS_ERR_BAD_UDP_SETTINGS == ercd)
    {
        dns_mng.dns_error_type = DNS_ERR_BAD_UDP_SETTINGS;
    }
    else if (DNS_ERR_INVALID_PACKET_RECEIVED == ercd)
    {
        dns_mng.dns_error_type = DNS_ERR_INVALID_PACKET_RECEIVED;
    }
    else
    {
        /* None */
    }
    return DNS_SUCCESS;
}

/***********************************************************************************************************************
* Function Name: R_TCPIP_DnsClientOpen
* Description  : Initialize DNS management variables
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
dns_err_t R_TCPIP_DnsClientOpen(void)
{
    dns_err_t ercd;

    ercd = DNS_SUCCESS;

    if (false == R_SYS_TIME_IsPeriodicCallbackRegistered((callback_from_sys_time_t) &timer_interrupt))
    {
        return DNS_ERR_MODULE_NOT_REGISTERED;
    }
    dns_mng.dns_select = DNS_SELECT_PRIMARY;           /* selected dns server <- primary */
    dns_mng.cb_func = NULL;                            /* callback function <- NULL      */
    memset(&dns_mng.name[0], 0, sizeof(dns_mng.name)); /* domain name <- all '\0'        */
    dns_mng.cepid = 0;                                 /* invalid ID                     */
    dns_ipaddr.dnsaddr1 = 0;
    dns_ipaddr.dnsaddr2 = 0;
    dns_mng.cepid = DNS_CFG_UDP_CEP_ID;
    if (dns_mng.proc < DNS_PROC_NUM)
    {
        ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_CALL_OPEN_FUNCTION]();
    }
    else
    {
        /* System Error!! */
    }
    R_SYS_TIME_RegisterPeriodicCallback((callback_from_sys_time_t)&dns_client_process, 1);

    return ercd;
}

/***********************************************************************************************************************
* Function Name: R_TCPIP_DnsClientRegisterServerAddress
* Description  : Setting the DNS server IP address
* Arguments    : dns_ip1 -
*                       DNS server IP address 1
*                dns_ip2 -
*                       DNS server IP address 2
* Return Value : error code
***********************************************************************************************************************/

dns_err_t R_TCPIP_DnsClientRegisterServerAddress(uint8_t *dns_ipaddr1, uint8_t *dns_ipaddr2)
{
    if(DNS_PROC_REST == dns_mng.proc)
    {
        return DNS_ERR_NOT_OPENED;
    }

    if ((0 != dns_ipaddr1) && (0 != dns_ipaddr2))
    {
        dns_mng.dns_select_sub = DNS_SELECT_PRIMARY;           /* selected dns server <- primary */
        memcpy(&dns_ipaddr_sub.dnsaddr1, dns_ipaddr1, 4);
        memcpy(&dns_ipaddr_sub.dnsaddr2, dns_ipaddr2, 4);

        dns_ipaddr_sub.dnsaddr1 = htonl(dns_ipaddr_sub.dnsaddr1);
        dns_ipaddr_sub.dnsaddr2 = htonl(dns_ipaddr_sub.dnsaddr2);
    }
    else if ((0 != dns_ipaddr1) && (0 == dns_ipaddr2))
    {
        dns_mng.dns_select_sub = DNS_SELECT_SECONDARY;           /* selected dns server <- secondary */
        memcpy(&dns_ipaddr_sub.dnsaddr2, dns_ipaddr1, 4);
        dns_ipaddr_sub.dnsaddr2 = htons(dns_ipaddr_sub.dnsaddr2);
    }
    else if (0 == dns_ipaddr1)
    {
#ifdef _UNIT_TEST_DNS
        memcpy(&dns_ipaddr_sub.dnsaddr1, dns_ipaddr1, 4);
        memcpy(&dns_ipaddr_sub.dnsaddr2, dns_ipaddr2, 4);

        dns_ipaddr_sub.dnsaddr1 = htonl(dns_ipaddr_sub.dnsaddr1);
        dns_ipaddr_sub.dnsaddr2 = htonl(dns_ipaddr_sub.dnsaddr2);
#endif
        return DNS_ERR_SERVER_NOT_REGISTERED;
    }
    else
    {
        /* None */
    }

    return DNS_SUCCESS;
}

/***********************************************************************************************************************
* Function Name: R_TCPIP_DnsClientResolveName
* Description  : Setting the domain name you want to resolve
* Arguments    : name -
*                    address of domain name
*                func -
*                    callback function
* Return Value : error code
***********************************************************************************************************************/
dns_err_t R_TCPIP_DnsClientResolveName(char *name, DNS_CB_FUNC func)
{
    dns_err_t ercd;

    ercd = DNS_SUCCESS;

    if ((0 == dns_ipaddr_sub.dnsaddr1) && (0 == dns_ipaddr_sub.dnsaddr2))
    {
        return DNS_ERR_SERVER_NOT_REGISTERED;
    }

    if (DNS_PROC_UNRECEIVED_REQUEST == dns_mng.proc)
    {
#ifndef _UNIT_TEST_DNS
        dns_mng.cepid = DNS_CFG_UDP_CEP_ID;
#endif
        dns_mng.dns_select = dns_mng.dns_select_sub;
        memcpy(&dns_ipaddr, &dns_ipaddr_sub, sizeof(dns_ipaddr_sub));

        strncpy(&dns_mng.name[0], name, sizeof(dns_mng.name));
        dns_mng.cb_func = func;
        dns_mng.retry_cnt = DNS_ERROR_COUNT;                          /* Initialize retry counter       */

        if (dns_mng.proc < DNS_PROC_NUM)
        {
            ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_RECEIVED_REQUEST]();
        }
        else
        {
            /* System Error!! */
        }
    }
    else if (DNS_PROC_REST == dns_mng.proc)
    {
        ercd = DNS_ERR_NOT_OPENED;
    }
    else
    {
        ercd = DNS_ERR_PROCESSING;
    }
    return ercd;
}


