renesas-rx/rx65n-envision-kit/rx65n_envisionkit/benchmark/rx65n_envision_kit_demo/src/smc_gen/r_t4_dns_client_rx/src/r_dns_client.c
/***********************************************************************************************************************
* Function Name: R_TCPIP_DnsClientCallback
* Description  : DNS callback function
* Arguments    : cepid -
*                    the communication endpoint ID
*                fncd -
*                    function code
*                p_parblk -
*                    error code pointer
* Return Value : error code
***********************************************************************************************************************/
ER R_TCPIP_DnsClientCallback(ID cepid, FN fncd , VP p_parblk)
{
    ER parblk;
    ER ercd;

    parblk = *(ER *)p_parblk;
    ercd   = DNS_SUCCESS;

    /* cepid is 1 fixed */
    if (dns_mng.cepid != cepid)
    {
        /* System Error!! */
    }

    if (DNS_PROC_NUM < dns_mng.proc)
    {
        /* System Error!! */
    }

    switch (fncd)
    {
        case TFN_UDP_SND_DAT:
            if (0 < parblk)    /* completed sending */
            {
                ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_CALLBACK_SEND]();
            }
            else if (E_CLS == parblk) /* send ARP timeout */
            {
                ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_CALLBACK_SEND_ARP_TIMEOUT]();
            }
            else if (E_RLWAI == parblk)
            {
                ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_CALLBACK_CANCEL]();
            }
            else
            {
                /* None */
            }
            break;

        case TEV_UDP_RCV_DAT:
            if (0 < parblk)    /* completed receiving */
            {
                ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_CALLBACK_RECEIVE]();
            }
            break;

        default:
            /* None */
            break;
    }
    return ercd;
}

/***********************************************************************************************************************
* Function Name: R_TCPIP_DnsClientClose
* Description  : DNS close function
* Arguments    : None
* Return Value : error code
***********************************************************************************************************************/

dns_err_t  R_TCPIP_DnsClientClose(void)
{
    dns_err_t ercd;

    ercd = dns_proc_table[dns_mng.proc][DNS_EVENT_CALL_CLOSE_FUNCTION]();

    return ercd;
}

/*****************************************************************************
* Function Name: R_TCPIP_DnsClientGetVersion
* Description  : Returns the version of this module. The version number is
*                encoded such that the top two bytes are the major version
*                number and the bottom two bytes are the minor version number.
* Arguments    : none
* Return Value : version number
******************************************************************************/
#pragma inline(R_TCPIP_DnsClientGetVersion)
uint32_t  R_TCPIP_DnsClientGetVersion(void)
{
    uint32_t const version = (T4_DNS_CLIENT_VERSION_MAJOR << 16) | T4_DNS_CLIENT_VERSION_MINOR;

    return version;
}
